MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA6T2AD3CFP/mcu.h
/* ========================================================  TRGSTS  ========================================================= */
 #define R_TFU_TRGSTS_BSYF_Pos    (0UL)          /*!< BSYF (Bit 0)                                          */
 #define R_TFU_TRGSTS_BSYF_Msk    (0x1UL)        /*!< BSYF (Bitfield-Mask: 0x01)                            */
 #define R_TFU_TRGSTS_ERRF_Pos    (1UL)          /*!< ERRF (Bit 1)                                          */
 #define R_TFU_TRGSTS_ERRF_Msk    (0x2UL)        /*!< ERRF (Bitfield-Mask: 0x01)                            */
/* =========================================================  SCDT0  ========================================================= */
 #define R_TFU_SCDT0_SCDT0_Pos    (0UL)          /*!< SCDT0 (Bit 0)                                         */
 #define R_TFU_SCDT0_SCDT0_Msk    (0xffffffffUL) /*!< SCDT0 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  SCDT1  ========================================================= */
 #define R_TFU_SCDT1_SCDT1_Pos    (0UL)          /*!< SCDT1 (Bit 0)                                         */
 #define R_TFU_SCDT1_SCDT1_Msk    (0xffffffffUL) /*!< SCDT1 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  ATDT0  ========================================================= */
 #define R_TFU_ATDT0_ATDT0_Pos    (0UL)          /*!< ATDT0 (Bit 0)                                         */
 #define R_TFU_ATDT0_ATDT0_Msk    (0xffffffffUL) /*!< ATDT0 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  ATDT1  ========================================================= */
 #define R_TFU_ATDT1_ATDT1_Pos    (0UL)          /*!< ATDT1 (Bit 0)                                         */
 #define R_TFU_ATDT1_ATDT1_Msk    (0xffffffffUL) /*!< ATDT1 (Bitfield-Mask: 0xffffffff)                     */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================================================================================== */
/* ================                                         R_ECCMB0                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  EC710CTL  ======================================================== */
 #define R_ECCMB0_EC710CTL_ECEMF_Pos      (0UL)          /*!< ECEMF (Bit 0)                                         */
 #define R_ECCMB0_EC710CTL_ECEMF_Msk      (0x1UL)        /*!< ECEMF (Bitfield-Mask: 0x01)                           */
 #define R_ECCMB0_EC710CTL_ECER1F_Pos     (1UL)          /*!< ECER1F (Bit 1)                                        */
 #define R_ECCMB0_EC710CTL_ECER1F_Msk     (0x2UL)        /*!< ECER1F (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_ECER2F_Pos     (2UL)          /*!< ECER2F (Bit 2)                                        */
 #define R_ECCMB0_EC710CTL_ECER2F_Msk     (0x4UL)        /*!< ECER2F (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_EC1EDIC_Pos    (3UL)          /*!< EC1EDIC (Bit 3)                                       */
 #define R_ECCMB0_EC710CTL_EC1EDIC_Msk    (0x8UL)        /*!< EC1EDIC (Bitfield-Mask: 0x01)                         */
 #define R_ECCMB0_EC710CTL_EC2EDIC_Pos    (4UL)          /*!< EC2EDIC (Bit 4)                                       */
 #define R_ECCMB0_EC710CTL_EC2EDIC_Msk    (0x10UL)       /*!< EC2EDIC (Bitfield-Mask: 0x01)                         */
 #define R_ECCMB0_EC710CTL_EC1ECP_Pos     (5UL)          /*!< EC1ECP (Bit 5)                                        */
 #define R_ECCMB0_EC710CTL_EC1ECP_Msk     (0x20UL)       /*!< EC1ECP (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_ECERVF_Pos     (6UL)          /*!< ECERVF (Bit 6)                                        */
 #define R_ECCMB0_EC710CTL_ECERVF_Msk     (0x40UL)       /*!< ECERVF (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_ECER1C_Pos     (9UL)          /*!< ECER1C (Bit 9)                                        */
 #define R_ECCMB0_EC710CTL_ECER1C_Msk     (0x200UL)      /*!< ECER1C (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_ECER2C_Pos     (10UL)         /*!< ECER2C (Bit 10)                                       */
 #define R_ECCMB0_EC710CTL_ECER2C_Msk     (0x400UL)      /*!< ECER2C (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_ECOVFF_Pos     (11UL)         /*!< ECOVFF (Bit 11)                                       */
 #define R_ECCMB0_EC710CTL_ECOVFF_Msk     (0x800UL)      /*!< ECOVFF (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_EMCA_Pos       (14UL)         /*!< EMCA (Bit 14)                                         */
 #define R_ECCMB0_EC710CTL_EMCA_Msk       (0xc000UL)     /*!< EMCA (Bitfield-Mask: 0x03)                            */
 #define R_ECCMB0_EC710CTL_ECSEDF0_Pos    (16UL)         /*!< ECSEDF0 (Bit 16)                                      */
 #define R_ECCMB0_EC710CTL_ECSEDF0_Msk    (0x10000UL)    /*!< ECSEDF0 (Bitfield-Mask: 0x01)                         */
 #define R_ECCMB0_EC710CTL_ECDEDF0_Pos    (17UL)         /*!< ECDEDF0 (Bit 17)                                      */
 #define R_ECCMB0_EC710CTL_ECDEDF0_Msk    (0x20000UL)    /*!< ECDEDF0 (Bitfield-Mask: 0x01)                         */
/* =======================================================  EC710TMC  ======================================================== */
 #define R_ECCMB0_EC710TMC_ECDCS_Pos      (1UL)          /*!< ECDCS (Bit 1)                                         */
 #define R_ECCMB0_EC710TMC_ECDCS_Msk      (0x2UL)        /*!< ECDCS (Bitfield-Mask: 0x01)                           */
 #define R_ECCMB0_EC710TMC_ECTMCE_Pos     (7UL)          /*!< ECTMCE (Bit 7)                                        */
 #define R_ECCMB0_EC710TMC_ECTMCE_Msk     (0x80UL)       /*!< ECTMCE (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710TMC_ETMA_Pos       (14UL)         /*!< ETMA (Bit 14)                                         */
 #define R_ECCMB0_EC710TMC_ETMA_Msk       (0xc000UL)     /*!< ETMA (Bitfield-Mask: 0x03)                            */
/* =======================================================  EC710TED  ======================================================== */
 #define R_ECCMB0_EC710TED_ECEDB_Pos      (0UL)          /*!< ECEDB (Bit 0)                                         */
 #define R_ECCMB0_EC710TED_ECEDB_Msk      (0xffffffffUL) /*!< ECEDB (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  EC710EAD0  ======================================================= */
 #define R_ECCMB0_EC710EAD0_ECEAD_Pos     (0UL)          /*!< ECEAD (Bit 0)                                         */
 #define R_ECCMB0_EC710EAD0_ECEAD_Msk     (0x3ffUL)      /*!< ECEAD (Bitfield-Mask: 0x3ff)                          */

/* =========================================================================================================================== */
/* ================                                          R_FLAD                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  FCKMHZ  ========================================================= */
 #define R_FLAD_FCKMHZ_FCKMHZ_Pos    (0UL)    /*!< FCKMHZ (Bit 0)                                        */
 #define R_FLAD_FCKMHZ_FCKMHZ_Msk    (0xffUL) /*!< FCKMHZ (Bitfield-Mask: 0xff)                          */

/** @} */ /* End of group PosMask_peripherals */

 #ifdef __cplusplus
}
 #endif

#endif                                 /* R7FA6T2BD_H */

/** @} */ /* End of group R7FA6T2BD */

/** @} */ /* End of group Renesas Electronics Corporation */
